quickstarts/demos/policy-security-wss-signencrypt/src/test/resources/xml/secure-request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-BD20F4BAB8FEB8D94514156345581576"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=bob,OU=NOT FOR PRODUCTION USE,O=apache.org</ds:X509IssuerName><ds:X509SerialNumber>1185847255</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>VTGLAGXSYaxz5kiAfQaYO0uv5VieR7y2O535gnc38voOkSUfFVYZ5t9OqHVlrJLGYXi4SkLXYI+xL36pEa/0ZDgdlgPL1a9kWJTZoo7wwKXRhKUuv7EXOtiN+ot8ucA3QLTS5c0YoP84N/Ld/kX8mZd587dlnIZMI+3tt0exxhc=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#ED-BD20F4BAB8FEB8D94514156345581737"/></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-BD20F4BAB8FEB8D94514156345580912">MIIB/jCCAWcCBEaul+owDQYJKoZIhvcNAQEEBQAwRjETMBEGA1UEChMKYXBhY2hlLm9yZzEfMB0GA1UECxMWTk9UIEZPUiBQUk9EVUNUSU9OIFVTRTEOMAwGA1UEAxMFYWxpY2UwHhcNMDcwNzMxMDIwMTE0WhcNMzQxMjE2MDIwMTE0WjBGMRMwEQYDVQQKEwphcGFjaGUub3JnMR8wHQYDVQQLExZOT1QgRk9SIFBST0RVQ1RJT04gVVNFMQ4wDAYDVQQDEwVhbGljZTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAs+0WE5RPyWU8bMLeytlFN0LSs32S6rmZbu9Qw2ohFoR0X6aQKk1LVbMPiRwsAFEDwIuf+z6sRTe9HGx0txXrBOaYswCddIZf4VXnMRmXrCWBggb1HB0pwjYHLeW3+QIQgFEU5tJPy8jQCI+x4UcgGImqvRyZQDVDP6iY/fJhZpkCAwEAATANBgkqhkiG9w0BAQQFAAOBgQBnOwsgA8i0QY8g5pSUk+i2IuBMNe1AQW4JwCPSJfl3dssHh/EjFb8JGVW6yo0sEQq4Ala/CHjUvHQGJnNJr8VPHzqRywug3VpmJp/9txSNLJsjIiOWbr2H3Mxl85CjH1sJnFAjohXZ0Mq5VRKR0sEbhALPyvTA2lAerEsVHe3jsg==</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-BD20F4BAB8FEB8D94514156345581155"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#_BD20F4BAB8FEB8D94514156345580761"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>x+UJvtqZVtBG5qQDm04NF8ug9xA=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Bbg3P3Rj2A434i/ptUUfzVN5/SxNrdyJaZZXNc0/ucUq35XGse30D8dVbJhE9sS2VcJ+BDkWNHqxF3O5rVdBVwHZzJtNSktbeHXP98scfOVZXN909hJvp4YH/Ln2Y9CNIKAFzxQMELmrSoF6z3l4Yt84EVODVVk3jFUBYg4Zdiw=</ds:SignatureValue><ds:KeyInfo Id="KI-BD20F4BAB8FEB8D94514156345580943"><wsse:SecurityTokenReference wsu:Id="STR-BD20F4BAB8FEB8D94514156345580954"><wsse:Reference URI="#X509-BD20F4BAB8FEB8D94514156345580912" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></SOAP-ENV:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_BD20F4BAB8FEB8D94514156345580761"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="ED-BD20F4BAB8FEB8D94514156345581737" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"><wsse:Reference URI="#EK-BD20F4BAB8FEB8D94514156345581576"/></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>f04soz1YpOcg7Fvu1G+Vvq3JeBdKxJnS8uDU8g+qjyLtxb0UBxucHr9EkXrk1GraZgxD6xxA0B2J5DLz6kSvKjpqvR9gm/ogBpGqRTw6ak6hTmfIdxsREGWcxqfLMbWd8BzvvXqab+4JHhDlYgRfd4yaST4A/VFO5RRRFXiwrJ9IVuWhMYJuRXDd0JDxb9PP/TgMVz5FPPv+1pIr9QCZbNPMrsrdaEsTTaft94mfGAlCYmG3G3O2i+c1VakjsX+eOxsGwOsh9gkzvbUCfYW88ZfrsQ32g2YHcA0MrhBRsIpdi2q79o9spEoHHatc60tn</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>
